{
    "event": [
        {
            "category": {
                "title": "Audio & Video",
                "icon": "videocam",
                "tags": [
                    "Audio & Video",
                    "WWDC 2014"
                ]
            },
            "sessions": [
                {
                    "title": "Direct Access to Video Encoding and Decoding",
                    "icon": "videocam",
                    "description": "Discover how to use AV Foundation and Video Toolbox to access hardware accelerated encoding and decoding services. Gain best practices for when it is appropriate to use a high-level or low-level API for encoding or decoding. Learn about multi-pass export for improved H.264 encoding and see how...",
                    "tags": [
                        "iOS",
                        "macOS"
                    ]
                }
            ]
        },
        {
            "category": {
                "title": "Design",
                "icon": "videogame_asset",
                "tags": [
                    "Design",
                    "WWDC 2014"
                ]
            },
            "sessions": [
                {
                    "title": "Ingredients of Great Games",
                    "icon": "videogame_asset",
                    "description": "Kick off the game development sessions of WWDC 2014 by gaining insight into the key ingredients needed to create a great game for iOS. Understand the importance of harnessing the full capabilities of the platform to create a richer gameplay experience. Get practical guidance about game production...",
                    "tags": [
                        "iOS"
                    ]
                },
                {
                    "title": "Prototyping: Fake It Till You Make It",
                    "icon": "build",
                    "description": "Make better apps by trying things out first, before you write any code. Get a glimpse of Apple's prototyping process and the range of tools and techniques we use, some of which might surprise you.",
                    "tags": [
                        "iOS",
                        "macOS"
                    ]
                }
            ]
        },
        {
            "category": {
                "title": "Graphics & Games",
                "icon": "videogame_asset",
                "tags": [
                    "Graphics & Games",
                    "WWDC 2014"
                ]
            },
            "sessions": [
                {
                    "title": "Working with Metal: Advanced",
                    "icon": "videogame_asset",
                    "description": "Building on the fundamentals, learn how to create advanced games and graphics applications with Metal. See how to construct your rendering pipeline, understand how to use compute and graphics together, and discover how to optimize your Metal-based app.",
                    "tags": [
                        "iOS"
                    ]
                },
                {
                    "title": "Working with Metal: Fundamentals",
                    "icon": "videogame_asset",
                    "description": "Start learning how to code with Metal in this step-by-step walkthrough of basic scene rendering. See the code you need to get your first Metal-based application up and running. Explore how to create graphics and compute shaders and efficiently animate scenes.",
                    "tags": [
                        "iOS"
                    ]
                },
                {
                    "title": "Working with Metal: Overview",
                    "icon": "videogame_asset",
                    "description": "Metal provides extremely efficient access to the graphics and compute power of the A7 chip. Get introduced to the essential concepts behind Metal, its low-overhead architecture, streamlined API, and unified shading language. See how Metal lets you take your iOS game or app to the next level of...",
                    "tags": [
                        "iOS"
                    ]
                }
            ]
        },
        {
            "category": {
                "title": "Safari & Web",
                "icon": "devices",
                "tags": [
                    "Safari & Web",
                    "WWDC 2014"
                ]
            },
            "sessions": [
                {
                    "title": "Adopting Handoff on iOS and OS X",
                    "icon": "devices",
                    "description": "Handoff allows people to seamlessly move activities between devices and pick up right where they left off. Learn how to save, transfer, and restore user activities in apps of all architectures. See how easy it is to add Handoff support to your iOS and OS X apps to make your user experience even...",
                    "tags": [
                        "iOS",
                        "macOS"
                    ]
                }
            ]
        }
    ]
}